Revit 2024 API
IFCGuidKey.GetHashCode Method
 Returns the hash code for this IFCGuidKey
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public override int GetHashCode()
Visual Basic
Public Overrides Function GetHashCode As Integer
Visual C++
public:
virtual int GetHashCode() override
Return Value
 A 32-bit signed integer hash code.
See Also
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace